{
    "base_model_name_or_path": "Qwen/Qwen2.5-3B-Instruct",
    "bias": "none",
    "lora_alpha": 64,
    "lora_dropout": 0.05,
    "r": 32,
    "target_modules": [
        "q_proj",
        "v_proj",
        "k_proj",
        "o_proj",
        "gate_proj",
        "down_proj",
        "up_proj"
    ],
    "task_type": "CAUSAL_LM",
    "peft_type": "LORA"
}